In [1]:

import pandas as pd

In [2]:

Country = ["France", "Spain", "Germany", "Spain","Germany","France","Spain","France","Germany","France"]
Age = [44,27,30,38,40,35,37,48,50,37]
Salary = [72000,48000,54000,61000,56000,58000,52000,79000,83000,67000]
Purchased = ["No","Yes","No","No","Yes","Yes","No","Yes","No","Yes"]

dict = {'Country': Country , 'Age': Age, 'Salary': Salary,'Purchased':Purchased}
     
df = pd.DataFrame(dict)

In [3]:
df

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   27   48000       Yes
2  Germany   30   54000        No
3    Spain   38   61000        No
4  Germany   40   56000       Yes
5   France   35   58000       Yes
6    Spain   37   52000        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   37   67000       Yes

In [4]:
df.to_csv('data.csv',index=False)

In [5]:
dataset = df.to_csv('data.csv', index=False)

In [6]:
dataset

In [7]:
df

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   27   48000       Yes
2  Germany   30   54000        No
3    Spain   38   61000        No
4  Germany   40   56000       Yes
5   France   35   58000       Yes
6    Spain   37   52000        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   37   67000       Yes

In [8]:
dataset = pd.read_csv('data.csv')

In [9]:
dataset

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   27   48000       Yes
2  Germany   30   54000        No
3    Spain   38   61000        No
4  Germany   40   56000       Yes
5   France   35   58000       Yes
6    Spain   37   52000        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   37   67000       Yes

In [10]:
dataset

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   27   48000       Yes
2  Germany   30   54000        No
3    Spain   38   61000        No
4  Germany   40   56000       Yes
5   France   35   58000       Yes
6    Spain   37   52000        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   37   67000       Yes

In [11]:
x = dataset[['Country','Age','Salary']].values

In [12]:
x

array([['France', 44, 72000],
       ['Spain', 27, 48000],
       ['Germany', 30, 54000],
       ['Spain', 38, 61000],
       ['Germany', 40, 56000],
       ['France', 35, 58000],
       ['Spain', 37, 52000],
       ['France', 48, 79000],
       ['Germany', 50, 83000],
       ['France', 37, 67000]], dtype=object)

In [13]:
y = dataset[['Purchased']].values

In [14]:
y

array([['No'],
       ['Yes'],
       ['No'],
       ['No'],
       ['Yes'],
       ['Yes'],
       ['No'],
       ['Yes'],
       ['No'],
       ['Yes']], dtype=object)

In [16]:
from sklearn.preprocessing import LabelEncoder

In [18]:
label_encoder_x = LabelEncoder()

In [21]:
x[:,0] = label_encoder_x.fit_transform(x[:,0])

In [22]:
x

array([[0, 44, 72000],
       [2, 27, 48000],
       [1, 30, 54000],
       [2, 38, 61000],
       [1, 40, 56000],
       [0, 35, 58000],
       [2, 37, 52000],
       [0, 48, 79000],
       [1, 50, 83000],
       [0, 37, 67000]], dtype=object)

In [23]:
from sklearn.preprocessing import OneHotEncoder

In [24]:
onehotencoder = OneHotEncoder()

In [25]:
x=onehotencoder.fit_transform(dataset.Country.values.reshape(-1,1)).toarray()

In [26]:
x

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [28]:
labelencoder_y = LabelEncoder()

In [29]:
y = labelencoder_y.fit_transform(y)

D:\anacondaa\lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [30]:
y

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1])

In [31]:
from sklearn.model_selection import train_test_split

In [33]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=0)

In [34]:
from sklearn.preprocessing import StandardScaler

In [37]:
sc_x =StandardScaler()

In [38]:
x_train = sc_x.fit_transform(x_train)

In [40]:
x_test = sc_x.transform(x_test)

In [41]:
x_train

array([[-1.        ,  2.64575131, -0.77459667],
       [ 1.        , -0.37796447, -0.77459667],
       [-1.        , -0.37796447,  1.29099445],
       [-1.        , -0.37796447,  1.29099445],
       [ 1.        , -0.37796447, -0.77459667],
       [-1.        , -0.37796447,  1.29099445],
       [ 1.        , -0.37796447, -0.77459667],
       [ 1.        , -0.37796447, -0.77459667]])